/*Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
*/
/*
int a,b,max;

Console.WriteLine("Inpute a first number: ");
a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Inpute a second number: ");
b = Convert.ToInt32(Console.ReadLine());

max = a;

if(a > b)
{
Console.WriteLine("max " + a);
}
else
{
Console.WriteLine("max " + b);
}
*/