/* Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).*/

int N;

Console.WriteLine("Input a number: ");
N = Convert.ToInt32(Console.ReadLine());

	if 
		(N % 2 == 0)
	 	{Console.WriteLine( "четное" );}
	else
	 	{Console.WriteLine("нечетное" );}

