/* Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.*/

int a,b,c,max;
Console.WriteLine("Inpute a first number: ");
a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Inpute a second number: ");
b = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Inpute a third number: ");
c = Convert.ToInt32(Console.ReadLine());


if(a >= b)
	max = a;
while
	max = b;
if	
(c >= b)
	max = c;
		
Console.WriteLine("max number is " + max);